clc
clear
%Θεόδωρος Κοξάνογλου P20094
Fs = 8000; %Συχνότητα Δειγματοληψίας
Dt = 1; %Διάρκεια κάθε μίας νότας του μουσικού κομματιού
notes = 12; %πλήθος νοτών
%Αιμίλιος Κουπάς Δανάς Π20100

for i = 1:1:notes
    sound(getNote(i, Dt, Fs, notes-i, 2),Fs); %μία οκτάβα προς τα πάνω
    pause(1);
end

%Δημιουργήσαμε Συνάρτηση που μας βοηθά στην εύκολη παραμετροποίηση του
%μουσικού κομματιού
function note = getNote(note, dt, fs, vol, octave)
    Ts = 1/fs; %Περίοδος Δειγματοληψίας    
    t = 0:Ts:dt; 
    note = vol*sin(2*pi*(220/octave)*2^(note/12)*t); % επιστρέφεται η σωστή νότα
end

%στην συνάρτηση ορίζουμε νέο dt, fs με βάση την εκφώνηση